# Интерактивный тренажер по SQL

## 1. Основы реляционной модели и SQL

   #### Содержание 
    Введение
    1.6 Таблица "Командировки", запросы на выборку
    1.7 Таблица "Нарушения ПДД", запросы корректировки
    
### Введение 

#### Установка Oracle Database и Oracle SQL Developer

- `Oracle Database` - [ПО](https://www.oracle.com/cis/database/technologies/oracle-database-software-downloads.html) объектно-реляционная система управления базами данных компании Oracle;
- `Oracle SQL Developer` - [ПО](https://www.oracle.com/database/sqldeveloper/technologies/download/) интегрированная среда разработки на языках SQL и PL/SQL, с возможностью администрирования баз данных, ориентирована на применение в среде Oracle Database.

После установки через Oracle SQL Developer переходим к настройке подключения к базе данных Oracle Database, щелкаем на + и выбираем «New Connection». В окне вводим данные пользователя, которые использовали при установки, заходим под системным username = SYS. После подключения серверу, отобразится обозреватель объектов и окно для написания SQL запросов. [Более подробней в источнике.](https://info-comp.ru/install-oracle-sql-developer)

**Следующий этап**, нужно создать нового пользователя/схему в Oracle Database для этого вводим команды SQL запросов:

```MYSQL 
/*PL/SLQ*/
ALTER SESSION SET "_ORACLE_SCRIPT"=TRUE; 
CREATE USER stepik_sql IDENTIFIED BY stepik;
```

**Второй этап**, передача Прав(Grant). [Более подробней в источнике.](https://youtu.be/lw_gny4zoEI) 

```MYSQL 
/*PL/SLQ*/
GRANT CREATE SESSION TO STEPIK_SQL;
GRANT CREATE TABLE TO STEPIK_SQL;
GRANT CREATE PROCEDURE TO STEPIK_SQL;
GRANT CREATE TRIGGER TO STEPIK_SQL;
GRANT CREATE VIEW TO STEPIK_SQL;
GRANT CREATE SEQUENCE TO STEPIK_SQL;
GRANT ALTER ANY TABLE TO STEPIK_SQL;
GRANT ALTER ANY PROCEDURE TO STEPIK_SQL;
GRANT ALTER ANY TRIGGER TO STEPIK_SQL;
GRANT ALTER PROFILE TO STEPIK_SQL;
GRANT DELETE ANY TABLE TO STEPIK_SQL;
GRANT DROP ANY TABLE TO STEPIK_SQL;
GRANT DROP ANY PROCEDURE TO STEPIK_SQL;
GRANT DROP ANY TRIGGER TO STEPIK_SQL;
GRANT DROP ANY VIEW TO STEPIK_SQL;
GRANT DROP PROFILE TO STEPIK_SQL;
```
```Python3
GRANT SELECT ON SYS.V_$SESSION TO STEPIK_SQL;
GRANT SELECT ON SYS.V_$SESSTAT TO STEPIK_SQL;
GRANT SELECT ON SYS.V_$STATNAME TO STEPIK_SQL;
GRANT SELECT ANY DICTIONARY TO STEPIK_SQL;
```
**Трейтий этап**, выделение памяти для добавления данных, в Oracle SQL Developer=>Other Users=><наш пользователь>=>Edit User=>Quotas=>USERS=>(Unlimited(V), Quota(100))=>Save

#### Подключение к Oracle Database из Jupyter Notebook

Для этого потребуется установить несколько библиотек. Для работы с Jupyter Notebook использована платформа Anaconda, все нужные библиотеки для работы были установлены именно в эту среду разработки.

##### Установка библиотек

- `ipython-sql` - [пакет](https://anaconda.org/conda-forge/ipython-sql) для работы с SQL запросами;
- `cx_oracle` - [пакет](https://anaconda.org/anaconda/cx_oracle) модуль, обеспечивает доступ к Oracle Database и соответствует спецификации API базы данных Python;
- `sqlalchemy` - ORM для работы с SQL БД.

In [1]:
import sqlalchemy

In [2]:
# 1. Cоздаем соединение, синтаксис sqlalchemy - "oracle+cx_oracle://'+user+':'+pw+'@'+host+':'+port+'/?service_name='+db'?'mode=Role")
sqlalchemy.create_engine("oracle://STEPIK_SQL:stepik@localhost:1521/orcl")

Engine(oracle://STEPIK_SQL:***@localhost:1521/orcl)

In [3]:
# 2. Загружаем extension
%load_ext sql 
#%reload_ext sql

In [4]:
# 3. Проверяем соединение
%sql oracle://STEPIK_SQL:stepik@localhost:1521/orcl

In [5]:
# 4. Проверяем какая версия Oracle Database установлена:
%sql SELECT * FROM v$version

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production', 'Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production\nVersion 19.3.0.0.0', 'Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production', 0)]

### 1.6 Таблица "Командировки", запросы на выборку

#### Создание таблицы
```MYSQL 
/*PL/SLQ*/
CREATE TABLE trip(
    trip_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY, 
    name VARCHAR(30),
    city VARCHAR(30),
    per_diem DECIMAL(8, 2),
    date_first DATE,
    date_last  DATE);

ALTER SESSION SET NLS_DATE_FORMAT = 'YYYY-MM-DD';

INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Баранов П.Е.', 'Москва', 700.00, '2020-01-12', '2020-01-17');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Абрамова К.А.', 'Владивосток', '450', '2020-01-14', '2020-01-27');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Семенов И.В.', 'Москва', 700, '2020-01-23', '2020-01-31');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Ильиных Г.Р.', 'Владивосток', 450, '2020-01-12', '2020-02-02');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Колесов С.П.', 'Москва', 700, '2020-02-01', '2020-02-06');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Баранов П.Е.', 'Москва', 700, '2020-02-14', '2020-02-22');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Абрамова К.А.', 'Москва', 700, '2020-02-23', '2020-03-01');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Лебедев Т.К.', 'Москва', 700, '2020-03-03', '2020-03-06');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Колесов С.П.', 'Новосибирск', 450, '2020-02-27', '2020-03-12');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Семенов И.В.', 'Санкт-Петербург', 700, '2020-03-29', '2020-04-05');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Абрамова К.А.', 'Москва', 700, '2020-04-06', '2020-04-14');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Баранов П.Е.', 'Новосибирск', 450, '2020-04-18', '2020-05-04');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Лебедев Т.К.', 'Томск', 450, '2020-05-20', '2020-05-31');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Семенов И.В.', 'Санкт-Петербург', 700, '2020-06-01', '2020-06-03');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Абрамова К.А.', 'Санкт-Петербург', 700, '2020-05-28', '2020-06-04');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Федорова А.Ю.', 'Новосибирск', 450, '2020-05-25', '2020-06-04');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Колесов С.П.', 'Новосибирск', 450, '2020-06-03', '2020-06-12');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Федорова А.Ю.', 'Томск', 450, '2020-06-20', '2020-06-26');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Абрамова К.А.', 'Владивосток', 450, '2020-07-02', '2020-07-13');
INSERT INTO trip (name, city, per_diem, date_first, date_last) VALUES ('Баранов П.Е.', 'Воронеж', 450, '2020-07-19', '2020-07-25');
SELECT * FROM trip;
```

#### Задание 1.6.1 
_Вывести из таблицы trip информацию о командировках тех сотрудников, фамилия которых заканчивается на букву «а», в отсортированном по убыванию даты последнего дня командировки виде. В результат включить столбцы name, city, per_diem, date_first, date_last._

In [11]:
%%sql

SELECT name, city, per_diem, date_first, date_last
FROM trip
WHERE name LIKE '%а %'
ORDER BY date_last DESC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.6.2 
_Вывести в алфавитном порядке фамилии и инициалы тех сотрудников, которые были в командировке в Москве._

In [12]:
%%sql

SELECT name
FROM trip
WHERE city = 'Москва'
GROUP BY name
ORDER BY name

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.6.3
_Для каждого города посчитать, сколько раз сотрудники в нем были.  Информацию вывести в отсортированном в алфавитном порядке по названию городов. Вычисляемый столбец назвать Количество._

In [14]:
%%sql
 
SELECT city, count(city) as Количество
FROM trip
GROUP BY city
ORDER BY city

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.6.4 
_Вывести два города, в которых чаще всего были в командировках сотрудники. Вычисляемый столбец назвать Количество._

In [16]:
%%sql

SELECT city, count(city) as Количество
FROM trip
GROUP BY city
ORDER BY Количество DESC
FETCH FIRST 2 ROWS ONLY

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.6.5 
_Вывести информацию о командировках во все города кроме Москвы и Санкт-Петербурга (фамилии и инициалы сотрудников, город ,  длительность командировки в днях, при этом первый и последний день относится к периоду командировки). Последний столбец назвать Длительность. Информацию вывести в упорядоченном по убыванию длительности поездки, а потом по убыванию названий городов (в обратном алфавитном порядке)._

In [17]:
%%sql

SELECT name, city, date_last-date_first+1 as Длительность
FROM trip
WHERE city NOT IN ('Москва','Санкт-Петербург')
ORDER BY Длительность DESC, city DESC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.6.6 
_Вывести информацию о командировках сотрудника(ов), которые были самыми короткими по времени. В результат включить столбцы name, city, date_first, date_last._

In [18]:
%%sql

SELECT name, city, date_first, date_last
FROM trip
WHERE (select min(date_last-date_first) from trip) = date_last-date_first

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.6.7
_Вывести информацию о командировках, начало и конец которых относятся к одному месяцу (год может быть любой). В результат включить столбцы name, city, date_first, date_last. Строки отсортировать сначала  в алфавитном порядке по названию города, а затем по фамилии сотрудника._

In [21]:
%%sql

SELECT name, city, date_first, date_last
FROM trip
WHERE TO_CHAR(date_first, 'MM') =  TO_CHAR(date_last, 'MM')
ORDER BY city, name

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.6.8 
_Вывести название месяца и количество командировок для каждого месяца. Считаем, что командировка относится к некоторому месяцу, если она началась в этом месяце. Информацию вывести сначала в отсортированном по убыванию количества, а потом в алфавитном порядке по названию месяца виде. Название столбцов – Месяц и Количество._

In [22]:
%%sql
          
SELECT TO_CHAR(date_first, 'Month') as Месяц, COUNT(date_first) as Количество 
FROM trip
GROUP BY TO_CHAR(date_first, 'Month')
ORDER BY Количество DESC, Месяц ASC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 1.6.8 
_Вывести сумму суточных (произведение количества дней командировки и размера суточных) для командировок, первый день которых пришелся на февраль или март 2020 года. Значение суточных для каждой командировки занесено в столбец per_diem. Вывести фамилию и инициалы сотрудника, город, первый день командировки и сумму суточных. Последний столбец назвать Сумма. Информацию отсортировать сначала  в алфавитном порядке по фамилиям сотрудников, а затем по убыванию суммы суточных._

In [24]:
%%sql

SELECT name, city, date_first, ((date_last-date_first)+1)*per_diem as Сумма
FROM trip
WHERE TO_CHAR(date_first, 'MM') = 2 OR TO_CHAR(date_first, 'MM') = 3
ORDER BY name, Сумма DESC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

## 1.7  Таблица "Нарушения ПДД", запросы корректировки
#### Создание таблицы

```MYSQL 
/*PL/SLQ*/

CREATE TABLE fine
(
    fine_id        INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name           VARCHAR(30),
    number_plate   VARCHAR(10),
    violation      VARCHAR(70),
    sum_fine       DECIMAL(8, 2),
    date_violation DATE,
    date_payment   DATE
);

ALTER SESSION SET NLS_DATE_FORMAT = 'YYYY-MM-DD';


INSERT INTO fine(name, number_plate, violation, sum_fine, date_violation, date_payment) VALUES ('Баранов П.Е.', 'P523BT', 'Превышение скорости(от 40 до 60)', 500.00, '2020-01-12', '2020-01-17');
INSERT INTO fine(name, number_plate, violation, sum_fine, date_violation, date_payment) VALUES ('Абрамова К.А.', 'О111AB', 'Проезд на запрещающий сигнал', 1000.00, '2020-01-14', '2020-02-27');
INSERT INTO fine(name, number_plate, violation, sum_fine, date_violation, date_payment) VALUES ('Яковлев Г.Р.', 'T330TT', 'Превышение скорости(от 20 до 40)', 500.00, '2020-01-23', '2020-02-23');
INSERT INTO fine(name, number_plate, violation, sum_fine, date_violation, date_payment) VALUES ('Яковлев Г.Р.', 'M701AA', 'Превышение скорости(от 20 до 40)', NULL, '2020-01-12', NULL);
INSERT INTO fine(name, number_plate, violation, sum_fine, date_violation, date_payment) VALUES ('Колесов С.П.', 'K892AX', 'Превышение скорости(от 20 до 40)', NULL, '2020-02-01', NULL);
INSERT INTO fine(name, number_plate, violation, sum_fine, date_violation, date_payment) VALUES ('Баранов П.Е.', 'P523BT', 'Превышение скорости(от 40 до 60)', NULL, '2020-02-14', NULL);
INSERT INTO fine(name, number_plate, violation, sum_fine, date_violation, date_payment) VALUES ('Абрамова К.А.', 'О111AB', 'Проезд на запрещающий сигнал', NULL, '2020-02-23', NULL);
INSERT INTO fine(name, number_plate, violation, sum_fine, date_violation, date_payment) VALUES ('Яковлев Г.Р.', 'T330TT', 'Проезд на запрещающий сигнал', NULL, '2020-03-03', NULL);

CREATE TABLE traffic_violation
(
    violation_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    violation    VARCHAR(70),
    sum_fine     DECIMAL(8, 2)
);

INSERT INTO traffic_violation(violation, sum_fine) VALUES ('Превышение скорости(от 20 до 40)', 500);
INSERT INTO traffic_violation(violation, sum_fine) VALUES ('Превышение скорости(от 40 до 60)', 1000);
INSERT INTO traffic_violation(violation, sum_fine) VALUES ('Проезд на запрещающий сигнал', 1000);

```

#### Задание 1.7.1
_Занести в таблицу fine суммы штрафов, которые должен оплатить водитель, в соответствии с данными из таблицы traffic_violation. При этом суммы заносить только в пустые поля столбца  sum_fine. Таблица traffic_violationсоздана и заполнена. 
Важно! Сравнение значения столбца с пустым значением осуществляется с помощью оператора IS NULL._

In [48]:
%%sql

UPDATE fine as f, traffic_violation AS tv  
SET f.sum_fine = IF(f.sum_fine IS NULL,  tv.sum_fine, f.sum_fine)
WHERE f.sum_fine IS NULL AND f.violation = tv.violation;

SELECT * FROM fine

UPDATE fine as f, traffic_violation AS tv  
SET f.sum_fine = (CASE WHEN f.sum_fine IS NULL THEN tv.sum_fine ELSE f.sum_fine END)
WHERE f.sum_fine IS NULL AND f.violation = tv.violation;

SELECT * FROM fine;

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 2, 8), ('Достоевский Ф.М.', 3, 23), ('Есенин С.А.', 1, 15)]

#### Задание 1.7.3
_Вывести фамилию, номер машины и нарушение только для тех водителей, которые на одной машине нарушили одно и то же правило   два и более раз. При этом учитывать все нарушения, независимо от того оплачены они или нет. Информацию отсортировать в алфавитном порядке, сначала по фамилии водителя, потом по номеру машины и, наконец, по нарушению._

In [25]:
%%sql

SELECT name, number_plate, violation FROM fine
GROUP BY name, number_plate, violation
HAVING count(*) > 1

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Абрамова К.А.', 'О111AB', 'Проезд на запрещающий сигнал'),
 ('Баранов П.Е.', 'P523BT', 'Превышение скорости(от 40 до 60)')]

#### Задание 1.7.4
_В таблице fine увеличить в два раза сумму неоплаченных штрафов для отобранных на предыдущем шаге записей_

In [50]:
%%sql

UPDATE fine, 
    (SELECT name, number_plate, violation FROM fine
     GROUP BY name, number_plate, violation
     HAVING count(*) > 1
    ) as query_in
SET  sum_fine = sum_fine*2
WHERE fine.date_payment IS NULL AND 
      fine.name = query_in.name AND 
      fine.number_plate = query_in.number_plate AND 
      fine.violation = query_in.violation;
SELECT * FROM fine;

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', Decimal('4715.47'), Decimal('719.31'), Decimal('3996.16')),
 ('Достоевский Ф.М.', Decimal('11802.03'), Decimal('1800.31'), Decimal('10001.72')),
 ('Есенин С.А.', 9750, Decimal('1487.29'), Decimal('8262.71'))]

#### Задание 1.3.5
_Водители оплачивают свои штрафы. В таблице payment занесены даты их оплаты:

Необходимо:

в таблицу fine занести дату оплаты соответствующего штрафа из таблицы payment; 
уменьшить начисленный штраф в таблице fine в два раза  (только для тех штрафов, информация о которых занесена в таблицу payment) , если оплата произведена не позднее 20 дней со дня нарушения._

In [51]:
%%sql

UPDATE fine, payment
SET fine.date_payment = payment.date_payment,
    fine.sum_fine = if(DATEDIFF(fine.date_payment, fine.date_violation) <= 20, sum_fine/2, sum_fine)
    

WHERE fine.date_payment IS NULL AND
      fine.name = payment.name AND
      fine.number_plate = payment.number_plate AND
      fine.violation = payment.violation AND
      fine.date_violation = payment.date_violation;
SELECT * FROM fine;

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(460, Decimal('799.01'), Decimal('600.17'))]

#### Задание 1.7.6

_Создать новую таблицу back_payment, куда внести информацию о неоплаченных штрафах (Фамилию и инициалы водителя, номер машины, нарушение, сумму штрафа  и  дату нарушения) из таблицы fine._

In [26]:
%%sql

CREATE TABLE back_payment AS (SELECT name, number_plate, violation, sum_fine, date_violation
FROM fine
WHERE date_payment is null)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

In [27]:
%%sql

SELECT * FROM back_payment

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Яковлев Г.Р.', 'M701AA', 'Превышение скорости(от 20 до 40)', None, datetime.datetime(2020, 1, 12, 0, 0)),
 ('Колесов С.П.', 'K892AX', 'Превышение скорости(от 20 до 40)', None, datetime.datetime(2020, 2, 1, 0, 0)),
 ('Баранов П.Е.', 'P523BT', 'Превышение скорости(от 40 до 60)', None, datetime.datetime(2020, 2, 14, 0, 0)),
 ('Абрамова К.А.', 'О111AB', 'Проезд на запрещающий сигнал', None, datetime.datetime(2020, 2, 23, 0, 0)),
 ('Яковлев Г.Р.', 'T330TT', 'Проезд на запрещающий сигнал', None, datetime.datetime(2020, 3, 3, 0, 0))]